samples/C2BPaymentValidationAndConfirmationBinding.ValidateC2BPayment.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns1="http://cps.huawei.com/cpsinterface/c2bpayment">
 <SOAP-ENV:Body>
   <ns1:C2BPaymentValidationRequest>
    <TransType></TransType>
    <TransID></TransID>
    <TransTime></TransTime>
    <TransAmount></TransAmount>
    <BusinessShortCode></BusinessShortCode>
    <BillRefNumber></BillRefNumber>
    <InvoiceNumber></InvoiceNumber>
    <MSISDN></MSISDN>
    <KYCInfo>
     <KYCName></KYCName>
     <KYCValue></KYCValue>
    </KYCInfo>
    <KYCInfo>
     <KYCName></KYCName>
     <KYCValue></KYCValue>
    </KYCInfo>
   </ns1:C2BPaymentValidationRequest>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
