test234.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:c2b="http://cps.huawei.com/cpsinterface/c2bpayment">
   <soapenv:Header/>
   <soapenv:Body>
      <c2b:C2BPaymentValidationRequest>
         <TransactionType>PayBill</TransactionType>
         <TransID>5164143215326</TransID>
         <TransTime>20140227082020</TransTime>
         <TransAmount>123.00</TransAmount>
         <BusinessShortCode>12345</BusinessShortCode>
         <BillRefNumber>A0020</BillRefNumber>
         <InvoiceNumber></InvoiceNumber>
         <OrgAccountBalance>12345.00</OrgAccountBalance>
<ThirdPartyTransID></ThirdPartyTransID>
<MSISDN>254722703614</MSISDN>
         <KYCInfo>
                        <KYCName>[Personal Details][First Name]</KYCName>
                        <KYCValue>Hoiyor</KYCValue>
                </KYCInfo>
                <KYCInfo>
                        <KYCName>[Personal Details][Middle Name]</KYCName>
                        <KYCValue>G</KYCValue>
                </KYCInfo>
                <KYCInfo>
                        <KYCName>[Personal Details][Last Name]</KYCName>
                        <KYCValue>Chen</KYCValue>
                </KYCInfo>
      </c2b:C2BPaymentValidationRequest>
   </soapenv:Body>
</soapenv:Envelope>
