src/controllers/c2b/samples/validate.xml

<?xml version="1.0" encoding="utf-8" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <ns1:C2BPaymentConfirmationRequest xmlns:ns1="http://cps.huawei.com/cpsinterface/c2bpayment">
      <TransType>Pay Bill</TransType>
      <TransID>SFI9TYPX9J</TransID>
      <TransTime>20240618082632</TransTime>
      <TransAmount>270.00</TransAmount>
      <BusinessShortCode>290028</BusinessShortCode>
      <BillRefNumber>254715842888</BillRefNumber>
      <OrgAccountBalance>106915.00</OrgAccountBalance>
      <MSISDN>207790dd287fab583ffbe503bda29278861b4c063d891b0ef931e21ef83988e7</MSISDN>
      <KYCInfo>
        <KYCName>[Personal Details][First Name]</KYCName>
        <KYCValue>Chebet</KYCValue>
      </KYCInfo>
      <KYCInfo>
        <KYCName>[Personal Details][Middle Name]</KYCName>
        <KYCValue/>
      </KYCInfo>
      <KYCInfo>
        <KYCName>[Personal Details][Last Name]</KYCName>
        <KYCValue/>
      </KYCInfo>
    </ns1:C2BPaymentConfirmationRequest>
  </soapenv:Body>
</soapenv:Envelope>